artilleryTests.yml
config:
  target: "http://localhost:2000"
  # http:
  #   pool: 50
  phases:
    - duration: 20
      arrivalRate: 100
      name: 'Warm up'
    - duration: 40
      arrivalRate: 100
      rampTo: 500
      name: 'Ramp up'
    - duration: 60
      arrivalRate: 500
      name: 'Cruise'
    - duration: 30
      arrivalRate: 600
      name: 'Crash'
  payload:
    path: "productIds.csv"
    fields:
        - "products"
  # payload:
  #   path: "questionIds.csv"
  #   fields:
  #       - "questions"
scenarios:
  - name: "get questions"
    flow:
      - get:
          url: "/qa/questions/?product_id={{products}}"
          # url: "/qa/questions/{{ questions }}/answers"