artilleryTests.yml
config:
  target: "http://localhost:2000"
  # http:
  #   pool: 50
  phases:
    - duration: 30
      arrivalRate: 100
      rampTo: 500
      name: "Warm up the application"
    - duration: 120
      arrivalRate: 500
      name: "Sustained max load"
  payload:
    path: "productIds.csv"
    fields:
        - "products"
  # payload:
  #   path: "questionIds.csv"
  #   fields:
  #       - "questions"
scenarios:
  - name: "get questions"
    flow:
      - get:
          url: "/qa/questions/?product_id={{products}}"
          # url: "/qa/questions/{{ questions }}/answers"